10/data/attachments/4a8df16e32651339.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d71527df-6a9b-4f82-8964-1eb218cb90b6</nif:username>
            <nif:friendToBeAdded>Thomas_board_Friend_47626_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>